Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00/svd/PIC32CK1025SG00100.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="SIG">
         <name>SIG_NS</name>
         <baseAddress>0xE002EF00</baseAddress>
      </peripheral>
      <peripheral>
         <name>SPI_IXS</name>
         <version>035741a0</version>
         <description>Audio SPI with 8 channels compatibilty</description>
         <groupName>SPI_IXS</groupName>
         <prependToName>SPI_IXS_</prependToName>
         <baseAddress>0x45016000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x3C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SPI_IXS</name>
            <value>140</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>SPI Control Enable Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>SPI Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>SPI Enable (ON) bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>RUN STANDBY Mode Enable bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SELCTRL</name>
               <description>SPI Control Options Select Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLKINDLY</name>
                     <description>Serial Clock Input Delay for SDI sampling</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CLKINDLYSelect</name>
                        <enumeratedValue>
                           <name>TDLY0</name>
                           <description>0 Tap Delays</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TDLY1</name>
                           <description>1 Tap Delay</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TDLY2</name>
                           <description>2 Tap Delay</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TDLY3</name>
                           <description>3 Tap Delay</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRXISEL</name>
                     <description>SPI Receive Service Request Interrupt Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SRXISELSelect</name>
                        <enumeratedValue>
                           <name>RXBEMPTY</name>
                           <description>RXB Empty</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RXBNEMPTY</name>
                           <description>RXB Not Empty</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RXBHFULL</name>
                           <description>RXB Half Full</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RXBFULL</name>
                           <description>RXB Full</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IGNROV</name>
                     <description>Ignore Receive Overflow (for Audio Data Transmissions)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPHA</name>
                     <description>SPI Clock Edge Select bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPOL</name>
                     <description>Clock Polarity Select bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STXISEL</name>
                     <description>SPI Transmit Service Request Interrupt Select</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>STXISELSelect</name>
                        <enumeratedValue>
                           <name>TXBSREMPTY</name>
                           <description>TXB And SR Empty</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TXBEMPTY</name>
                           <description>TXB Empty</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TXBHEMPTY</name>
                           <description>TXB Half Empty</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TXBNFULL</name>
                           <description>TXB Not Full</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IGNTUR</name>
                     <description>Ignore Transmit Underrun (for Audio Data Transmissions)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATFMTLR</name>
                     <description>Packed data format -- left or right justified</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TURSAMP</name>
                     <description>Transmit Under-run last sample sent</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATFILL</name>
                     <description>DATFILL undefined bits 1 or 0</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MODEEN</name>
                     <description>MACRO MODE ENABLED</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>MODEENSelect</name>
                        <enumeratedValue>
                           <name>DFTLEN</name>
                           <description>Default Mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUDEN</name>
                           <description>Audio Mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TDMEN</name>
                           <description>Framed Mode</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPDEN</name>
                           <description>Broadcast Mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPICTRL</name>
               <description>SPI Control Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>Serial Word Length bits for AUDEN=0, not used when AUDEN=1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>MODESelect</name>
                        <enumeratedValue>
                           <name>MODE8</name>
                           <description>8 Bits Mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE16</name>
                           <description>16 Bits Mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE32</name>
                           <description>32 Bits Mode</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DISSDI</name>
                     <description>Disable SDI bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISSDO</name>
                     <description>Disable SDO bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSTEN</name>
                     <description>Master Mode Enable bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSSEN</name>
                     <description>Master/Slave Mode Select Enable bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPISGNEXT</name>
                     <description>Sign Extend Read Data from the RX FIFO</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMP</name>
                     <description>SPI Data Input Sample Phase bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
